specters312/SVD_DUMP/Atmel/ATSAM4LS8A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EIC</name>
      <version>3.0.2</version>
      <description>External Interrupt Controller</description>
      <groupName>EIC</groupName>
      <prependToName>EIC_</prependToName>
      <baseAddress>0x400F1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EIC_1</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>EIC_2</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>EIC_3</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>EIC_4</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>EIC_5</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>EIC_6</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>EIC_7</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>EIC_8</name>
        <value>52</value>
      </interrupt>
      <registers>
        <register>
          <name>ASYNC</name>
          <description>Asynchronous Register</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NMI</name>
              <description>External Non Maskable CPU interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT3</name>
              <description>External Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT4</name>
              <description>External Interrupt 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT5</name>
              <description>External Interrupt 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT6</name>
              <description>External Interrupt 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT7</name>
              <description>External Interrupt 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT8</name>
              <description>External Interrupt 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT9</name>
              <description>External Interrupt 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT10</name>
              <description>External Interrupt 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT11</name>
              <description>External Interrupt 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT12</name>
              <description>External Interrupt 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT13</name>
              <description>External Interrupt 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT14</name>
              <description>External Interrupt 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT15</name>
              <description>External Interrupt 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NMI</name>
              <description>External Non Maskable CPU interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT3</name>
              <description>External Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT4</name>
              <description>External Interrupt 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT5</name>
              <description>External Interrupt 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT6</name>
              <description>External Interrupt 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT7</name>
              <description>External Interrupt 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT8</name>
              <description>External Interrupt 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT9</name>
              <description>External Interrupt 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT10</name>
              <description>External Interrupt 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT11</name>
              <description>External Interrupt 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT12</name>
              <description>External Interrupt 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT13</name>
              <description>External Interrupt 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT14</name>
              <description>External Interrupt 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT15</name>
              <description>External Interrupt 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIS</name>
          <description>Disable Register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NMI</name>
              <description>External Non Maskable CPU interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT3</name>
              <description>External Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT4</name>
              <description>External Interrupt 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT5</name>
              <description>External Interrupt 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT6</name>
              <description>External Interrupt 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT7</name>
              <description>External Interrupt 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT8</name>
              <description>External Interrupt 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT9</name>
              <description>External Interrupt 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT10</name>
              <description>External Interrupt 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT11</name>
              <description>External Interrupt 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT12</name>
              <description>External Interrupt 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT13</name>
              <description>External Interrupt 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT14</name>
              <description>External Interrupt 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT15</name>
              <description>External Interrupt 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EDGE</name>
          <description>Edge Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NMI</name>
              <description>External Non Maskable CPU interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INT1Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggers on falling edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggers on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INT2Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggers on falling edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggers on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT3</name>
              <description>External Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INT3Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggers on falling edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggers on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT4</name>
              <description>External Interrupt 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INT4Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Triggers on falling edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Triggers on rising edge.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT5</name>
              <description>External Interrupt 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT6</name>
              <description>External Interrupt 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT7</name>
              <description>External Interrupt 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT8</name>
              <description>External Interrupt 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT9</name>
              <description>External Interrupt 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT10</name>
              <description>External Interrupt 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT11</name>
              <description>External Interrupt 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT12</name>
              <description>External Interrupt 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT13</name>
              <description>External Interrupt 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT14</name>
              <description>External Interrupt 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT15</name>
              <description>External Interrupt 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>Enable Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>NMI</name>
              <description>External Non Maskable CPU interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT3</name>
              <description>External Interrupt 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT4</name>
              <description>External Interrupt 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT5</name>
              <description>External Interrupt 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT6</name>
              <description>External Interrupt 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT7</name>
              <description>External Interrupt 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT8</name>
              <description>External Interrupt 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT9</name>
              <description>External Interrupt 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT10</name>
              <description>External Interrupt 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT11</name>
              <description>External Interrupt 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT12</name>
              <description>External Interrupt 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT13</name>
              <description>External Interrupt 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT14</name>
              <description>External Interrupt 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INT15</name>
              <description>External Interrupt 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
