specters312/SVD_DUMP/Atmel/ATSAM4LS8A.svd
        <register>
          <name>UPSTA7CLR</name>
          <description>Pipe Status Clear Register</description>
          <addressOffset>0x57C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINIC</name>
              <description>RXINI Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOUTIC</name>
              <description>TXOUTI Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSTPIC</name>
              <description>TXSTPI Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERRIC</name>
              <description>PERRI Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKEDIC</name>
              <description>NAKEDI Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRORFIC</name>
              <description>ERRORFI Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTALLDIC</name>
              <description>RXSTALLDI Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMACERIC</name>
              <description>RAMACERI Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPSTA7SET</name>
          <description>Pipe Status Set Register</description>
          <addressOffset>0x5AC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINIS</name>
              <description>RXINI Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXOUTIS</name>
              <description>TXOUTI Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXSTPIS</name>
              <description>TXSTPI Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERRIS</name>
              <description>PERRI Set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAKEDIS</name>
              <description>NAKEDI Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRORFIS</name>
              <description>ERRORFI Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXSTALLDIS</name>
              <description>RXSTALLDI Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RAMACERIS</name>
              <description>RAMACERI Set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCON</name>
          <description>General Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0x01004000</resetValue>
          <fields>
            <field>
              <name>FRZCLK</name>
              <description>Freeze USB Clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBE</name>
              <description>USBC Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIMOD</name>
              <description>USBC Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFSM</name>
          <description>USB internal finite state machine</description>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000009</resetValue>
          <fields>
            <field>
              <name>DRDSTATE</name>
              <description>DualRoleDevice state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>DRDSTATESelect</name>
                <enumeratedValue>
                  <name>A_IDLE</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_VRISE</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_BCON</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_HOST</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_SUSPEND</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_PERIPHERAL</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_VFALL</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_VBUS_ERR</name>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_WAIT_DISCHARGE</name>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_IDLE</name>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_PERIPHERAL</name>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_BEGIN_HNP</name>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_DISCHARGE</name>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_WAIT_ACON</name>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_HOST</name>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_SRP_INIT</name>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTA</name>
          <description>General Status Register</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>VBUSRQ</name>
              <description>VBus Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>FULL</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKUSABLE</name>
              <description>USB Clock Usable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>Suspend module state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTACLR</name>
          <description>General Status Clear Register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RAMACERIC</name>
              <description>RAMACERI Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQC</name>
              <description>VBUSRQ Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSTASET</name>
          <description>General Status Set Register</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RAMACERIS</name>
              <description>RAMACERI Set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VBUSRQS</name>
              <description>VBUSRQ Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UVERS</name>
          <description>IP Version Register</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000310</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
